app/controllers/reductions_controller.rb

  def show
    @reduction = Reduction.find(params[:id])
---
SELECT * FROM `reductions` WHERE (`reductions`.`id` = 1)

  def create
    @reduction = Reduction.new(params[:reduction])

    respond_to do |format|
      if @reduction.save
---
INSERT INTO `reductions` (`created_at`, `updated_at`, `type`, `value`) VALUES('2010-03-29 03:11:59', '2010-03-29 03:11:59', NULL, 7)